{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 151643,
  "dtype": "bfloat16",
  "eos_token_id": 151645,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 2560,
  "initializer_range": 0.02,
  "intermediate_size": 9728,
  "layer_types": [
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention",
    "full_attention"
  ],
  "max_position_embeddings": 40960,
  "max_window_layers": 36,
  "model_type": "qwen3",
  "num_attention_heads": 32,
  "num_hidden_layers": 36,
  "num_key_value_heads": 8,
  "quantization_config": {
    "add_skip_keys": false,
    "dequantize_fp32": false,
    "group_size": 0,
    "is_integer": true,
    "is_training": false,
    "modules_dtype_dict": {},
    "modules_to_not_convert": [
      ".x_embedder",
      ".img_in",
      "patch_embed",
      ".condition_embedder",
      "time_text_embed",
      "lm_head",
      ".time_embed",
      ".txt_out",
      "patch_emb",
      "multi_modal_projector",
      ".final_layer",
      ".vid_in",
      ".context_embedder",
      ".proj_out",
      ".norm_out",
      ".txt_in",
      ".emb_in",
      ".emb_out",
      "patch_embedding",
      "wte",
      ".vid_out",
      "lm_head.weight",
      ".img_out"
    ],
    "non_blocking": false,
    "quant_conv": false,
    "quant_method": "sdnq",
    "quantization_device": null,
    "quantized_matmul_dtype": null,
    "return_device": null,
    "svd_rank": 32,
    "svd_steps": 8,
    "use_grad_ckpt": true,
    "use_quantized_matmul": false,
    "use_quantized_matmul_conv": false,
    "use_static_quantization": true,
    "use_stochastic_rounding": false,
    "use_svd": true,
    "weights_dtype": "uint4"
  },
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tie_word_embeddings": true,
  "transformers_version": "4.57.1",
  "use_cache": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
