{
  "_class_name": "ZImageTransformer2DModel",
  "_diffusers_version": "0.36.0.dev0",
  "_name_or_path": "Tongyi-MAI/Z-Image-Turbo",
  "all_f_patch_size": [
    1
  ],
  "all_patch_size": [
    2
  ],
  "axes_dims": [
    32,
    48,
    48
  ],
  "axes_lens": [
    1536,
    512,
    512
  ],
  "cap_feat_dim": 2560,
  "dim": 3840,
  "in_channels": 16,
  "n_heads": 30,
  "n_kv_heads": 30,
  "n_layers": 30,
  "n_refiner_layers": 2,
  "norm_eps": 1e-05,
  "qk_norm": true,
  "quantization_config": {
    "add_skip_keys": true,
    "dequantize_fp32": false,
    "group_size": 0,
    "is_integer": true,
    "is_training": false,
    "modules_dtype_dict": {},
    "modules_to_not_convert": [
      "all_x_embedder",
      "cap_embedder",
      "all_final_layer",
      "t_embedder",
      "layers.0.adaLN_modulation.0.weight"
    ],
    "non_blocking": false,
    "quant_conv": false,
    "quant_method": "sdnq",
    "quantization_device": "xpu",
    "quantized_matmul_dtype": null,
    "return_device": "cpu",
    "svd_rank": 32,
    "svd_steps": 8,
    "use_grad_ckpt": true,
    "use_quantized_matmul": false,
    "use_quantized_matmul_conv": false,
    "use_static_quantization": true,
    "use_stochastic_rounding": false,
    "use_svd": true,
    "weights_dtype": "uint4"
  },
  "rope_theta": 256.0,
  "t_scale": 1000.0
}
